#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:nil d:(not "LOGBOOK") date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t title:t toc:nil todo:t |:t
#+TITLE: Org-clock-convenience
# #+DATE: <2016-02-14 Sun>
#+AUTHOR: Derek Feichtinger
#+EMAIL: dfeich@gmail.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
# #+CREATOR: Emacs 24.5.1 (Org mode 8.3.2)

** Tools for checking the settings

   This repository contains testing code that allows importing new
   configuration definitions and run the test suite on it, but I also
   provide a make target for displaying the matches from a built
   test agenda.

   For this example I defined new settings in the [[file:custom/with-effort.el][custom/with-effort.el]] file
   of this repository:
   #+begin_src emacs-lisp :exports source
(setq org-agenda-prefix-format '((agenda . " %i %-12:c%?-12t %?-10e% s")
                                 (todo . " %i %-12:c")
                                 (tags . " %i %-12:c")
                                 (search . " %i %-12:c")))

(setq org-clock-convenience-clocked-agenda-re
      "^ +\\([^:]+\\):[[:space:]]*\\(\\([ \t012][0-9]\\):\\([0-5][0-9]\\)\\)\\(?:-\\(\\( ?[012]?[0-9]\\):\\([0-5][0-9]\\)\\)\\|.*\\)?\\(?:[[:space:]]+\\([0-9:dhmin]+\\)\\)?[[:space:]]+Clocked:[[:space:]]+\\(([0-9]+:[0-5][0-9])\\|(-)\\)")

(setq org-clock-convenience-clocked-agenda-fields
      '(filename d1-time d1-hours d1-minutes d2-time d2-hours d2-minutes effort duration))
   #+END_SRC

   And now we can pass the new configuration into the test that is
   executed by the =test-regx= make target by giving its location in the
   =OCC_CONFIG= variable
   #+begin_src bash :results output :exports both
     OCC_CONFIG=custom/with-effort.el make test-regx
   #+end_src

   #+RESULTS:
   #+begin_example
   emacs --batch \
                        \
                               -l org-clock-convenience.el \
                               -l test/test-org-clock-convenience.el \
                       -l custom/with-effort.el \
                               --eval "(occ-print-all-agendaline-vals)"
   Emacs version: GNU Emacs 27.2 (build 1, x86_64-pc-linux-gnu, GTK+ Version 3.22.30)
    of 2021-08-29
   Org version: 9.4.4
   org-agenda-prefix-format set to:
   ((agenda . " %i %-12:c%?-12t %?-10e% s")
    (todo . " %i %-12:c")
    (tags . " %i %-12:c")
    (search . " %i %-12:c"))

   ########## GENERATED AGENDA ##########
   Day-agenda (W15):
   Friday     15 April 2022
     testfile:    8:00- 9:00  1:00      Clocked:   (1:00) TODO TaskA - State "TODO"       from              [2022-04-15 Fri 07:30]
                  8:00......  ----------------
     testfile:    9:00......  1:00      TODO TaskA
     testfile:    9:30- 9:55  1d3h5min  Clocked:   (0:25) WAIT [#A] TaskB - State "WAIT"       from "TODO"       [2022-04-15 Fri 09:50] \
     testfile:    9:50......  1d3h5min  Scheduled:  WAIT [#A] TaskB
                 10:00......  ----------------
     testcat:    11:00-12:00  Clocked:   (1:00) TaskC
                 12:00......  ----------------
                 14:00......  ----------------
                 16:00......  ----------------
                 18:00......  ----------------
                 20:00......  ----------------
   ######################################
   AGENDA_LINE:   testfile:    8:00- 9:00  1:00      Clocked:   (1:00) TODO TaskA - State "TODO"       from              [2022-04-15 Fri 07:30]
   ((filename "testfile")
    (d1-time " 8:00")
    (d1-hours " 8")
    (d1-minutes "00")
    (d2-time " 9:00")
    (d2-hours " 9")
    (d2-minutes "00")
    (effort "1:00")
    (duration "(1:00)"))
   AGENDA_LINE:   testfile:    9:30- 9:55  1d3h5min  Clocked:   (0:25) WAIT [#A] TaskB - State "WAIT"       from "TODO"       [2022-04-15 Fri 09:50] \
   ((filename "testfile")
    (d1-time " 9:30")
    (d1-hours " 9")
    (d1-minutes "30")
    (d2-time " 9:55")
    (d2-hours " 9")
    (d2-minutes "55")
    (effort "1d3h5min")
    (duration "(0:25)"))
   AGENDA_LINE:   testcat:    11:00-12:00  Clocked:   (1:00) TaskC
   ((filename "testcat")
    (d1-time "11:00")
    (d1-hours "11")
    (d1-minutes "00")
    (d2-time "12:00")
    (d2-hours "12")
    (d2-minutes "00")
    (effort nil)
    (duration "(1:00)"))
   Found 3 matching lines in the agenda
   #+end_example

   Naturally, you can also execute the test suite for checking the new
   configuration

   #+begin_src bash :results output :exports source
     OCC_CONFIG=custom/with-effort.el make test
   #+END_SRC
   #+begin_src bash :results output :exports results
     OCC_CONFIG=custom/with-effort.el make test 2>&1
   #+END_SRC

   #+RESULTS:
   #+begin_example
   Emacs binary at /usr/local/emacs/bin/emacs
   emacs --batch \
                        \
                               -l org-clock-convenience.el \
                               -l test/test-org-clock-convenience.el \
                       -l custom/with-effort.el \
                --eval "(princ (format \"Emacs version: %s\n\" (emacs-version)) t)" \
        --eval "(princ (format \"Org version: %s\n\" (org-version)) t)" \
                --eval "(ert-run-tests-batch-and-exit nil)"

   Running 6 tests (2022-05-01 18:31:30+0200, selector ‘t’)

      passed  1/6  occ-test-agenda-re1 (0.318694 sec)

      passed  2/6  occ-test-agenda-re2 (0.021884 sec)
      passed  3/6  occ-test-clockline-re1 (0.000152 sec)

      passed  4/6  occ-test-fill-gap-both (0.026258 sec)

      passed  5/6  occ-test-timestamp-change-hours (0.006018 sec)

      passed  6/6  occ-test-timestamp-change-minutes (0.023669 sec)

   Ran 6 tests, 6 results as expected, 0 unexpected (2022-05-01 18:31:30+0200, 0.396951 sec)

   Emacs version: GNU Emacs 27.2 (build 1, x86_64-pc-linux-gnu, GTK+ Version 3.22.30)
    of 2021-08-29
   Org version: 9.4.4
   #+end_example

